import 'package:flutter/material.dart';

import 'package:jh_legal_affairs/util/tools.dart';

class ProtocolPage extends StatefulWidget {
  @override
  _ProtocolPageState createState() => _ProtocolPageState();
}

class _ProtocolPageState extends State<ProtocolPage> {
  @override
  Widget build(BuildContext context) {
    return new Scaffold(
      backgroundColor: Colors.white,
      appBar: new NavigationBar(title: '用户协议'),
      body: new ListView(
        padding: EdgeInsets.all(10),
        children: <Widget>[
          new Text(content),
        ],
      ),
    );
  }
}

String content = '''尊敬的用户：
欢迎您（以下简称“甲方”）与本平台经营者（以下简称“乙方”）共同签署《注册协议》（以下简称“本协议”），并使用本平台服务。
甲方在申请注册流程中点击同意本协议之前，应当认真阅读、充分理解各条款内容。如甲方对协议有任何疑问，可通过本平台提供的各种联系方式向本平台咨询。当甲方点击同意本协议，即表示已接受并知悉了以下所述的全部条款和条件，自愿认可和信守本协议内容，包括但不限于本协议和权利归属与隐私政策。
第一条	定义
本平台：指包括本网站、移动端及本平台经营者参股或控股的网站或移动端及由本平台经营者或其关联公司经营的其他网站及其客户端（包含但不限于：网站、APP、手机端、小程序及直播平台），以下简称“本平台”。
本平台经营者：珠海法智科技有限公司。
甲方：指本平台的使用者，包括客户和服务方。
乙方：指本平台、本平台经营者。
平台规则：指本平台发布的各项规则、规范、规定的总称。
客户：购买法律服务者。
服务方：法律服务的提供者。
第二条	协议的范围
(一)	本协议的内容包括协议正文及本平台目前及将来可能发布的各项声明、政策及规则；该等内容为本协议不可分割的组成部分，与本协议正文具有同等法律效力。
(二)	当甲方注册时同意本协议的，甲方即成为本平台的会员，本协议即生效，并构成对甲乙双方具有约束力的法律文件。
（三）特别说明：本协议内容不适用于其他第三方向甲方提供的服务，为确保流畅的产品体验，甲方可能会收到来自第三方提供的内容或网络链接。请谨慎选择是否访问第三方提供的链接、内容、产品和服务。在向第三方提交个人信息之前，请认真阅读这些第三方的隐私政策。
第三条	账户注册
(一)	会员资格：（1）甲方作为客户，在此确认，在甲方开始注册程序前或以本平台允许的方式实际使用本平台服务时，甲方已具备中华人民共和国法律规定的与甲方行为相适应的民事行为能力及相关的资格资质。若甲方不具备前述与您行为相适应的民事行为能力，则甲方及其的监护人应依照法律规定承担因此而导致的一切后果。（2）甲方作为服务方，在此确认，在甲方开始注册程序前或以本平台允许的方式实际使用本平台服务时，甲方已具备中华人民共和国法律规定的与甲方行为相适应的民事行为能力及相关的资格资质。若甲方不具备前述与甲方行为相适应的民事行为能力及资格资质的，则甲方应依照法律规定承担因此而导致的一切后果。（3）甲方同意本平台或法律法规规定的有权限的机构对其提供的信息或资料进行查证，经验证不符合注册条件的，本平台有权拒绝甲方的注册申请。
(二)	账户转让：除非有法律规定或司法裁定，或者符合本站公布的条件，否则甲方在本站的账号信息不得以任何方式转让、赠与或继承。转让、赠与或继承需提供本站要求的合格的文件材料并根据本站制定的操作流程办理。
第四条	账户管理
(一)	在完成账户注册后，甲方作为客户，应按照法律法规要求及本平台的页面提示，向本站提供必要的个人资料信息。对于实名认证的资料信息，甲方应确保并始终保持所提资料的真实性及有效性，如有合理理由怀疑甲方提供的资料不实、无效或不完整的，本平台有权要求甲方加以改正，并直接做出删除相应资料的处理、中止或终结对甲方提供部分或全部服务，甲方将承担因此产生的任何直接或间接损失及不利后果，本平台对此不承担任何责任。
(二)	在完成账户注册后，甲方如申请开通服务方权限，须向本平台提交身份证、执业证等认证资料，认证资料通过本平台审查后，甲方方可作为服务方在本平台提供服务。甲方提交的服务方认证资料须真实有效，在通过本平台审查后，如身份认证信息发生变化的，甲方须及时提交变更后的资料。此外，甲方还应按照本平台的页面提示，填写服务方基本信息、联系信息、执业信息等，并应确保其填写信息的真实性和准确性，相关信息发生变化后应及时予以修改；相关介绍性文字应实事求是，不得含有夸大或误导的成分。
(三)	甲方填写的账户信息，不得违反国家法律法规及本平台的管理规定，不得包含违法、涉嫌侵犯他人权利或干扰本平台运营秩序等相关内容，否则本平台有权删除相关信息。
(四)	甲方的账户为甲方自行设置并由甲方保管，甲方须自行负责对甲方的用户名、密码等登录信息保密。账户因甲方主动泄露或遭受他人攻击、诈骗或受到网络黑客或被其他不法窃取等行为导致的损失及后果，均由甲方自行承担，本平台免责。
(五)	甲方应对甲方账户项下的所有行为结果负责，包括但不限于填写信息、发布信息、提供服务等。
(六)	如发现任何未经授权使用甲方账户登录本平台或其他可能导致甲方账户遭窃、遗失的情况，建议甲方立即通知本平台。甲方理解本平台对甲方的任何请求采取行动均需要合理时间，本平台对在采取行动前已经产生的后果不承担责任。
(七)	如发现甲方的账户存在异常、被恶意攻击，或发现任何人利用网站技术漏洞或采取不正当手段获取利益（包括但不限于平台奖励等），本平台认为可能或已经对平台正常运营造成干扰，损害平台或其他会员权益的，本平台有权对该甲方及账户采取一种或多种监管处理措施，包括但不限于：限制权限、限制登录、查封账户、禁止登录、删除等措施，并追究侵权人的法律责任。
(八)	如因任何原因，包括但不限于：信息网络设备维护、升级、连接故障，电脑、网络、通讯或其他系统的故障、计算机病毒、程序错误、黑客攻击、欺诈违规等不当行为、不可抗力等，导致甲方账户内财富金额或其他数据出现错误或异常的，本平台有权进行核查并根据核查结果对账户财富及各项数据按正常真实数值予以恢复，保障账户正常。甲方主张对前述错误或异常的财富金额或数据予以确认或提现的，本平台不予支持；甲方主张该等财富金额或数据并无错误或异常的，应提出相关证据资料，由平台进行审查和确定。
(九)	对于本平台通过优惠、奖励、抽奖等形式，向甲方发放或提供的任何形式的奖励或利益，本平台有权就甲方获得该等奖励或利益的过程及结果进行核查。如本平台认定存在欺诈、违规、采取不正当手段等任何有违公平诚信善意原则行为的，本平台有权向该甲方收回部分或全部奖励或利益，并追究相关人员的法律责任。
(十)甲方申请注销账户的，应按照平台要求提供相关资料文件，平台审查通过后，将对该账号进行注销。
第五条	本平台对客户提供的服务及使用规范
(一)	客户可以在本平台进行在线交易，包括但不限于下载合同文书范本、发布需求信息、查询服务方信息、达成交易、接受服务成果、对服务方服务进行确认、评价等本平台提供的服务。
(二)	客户可以在本平台浏览、阅读资讯及文章，参加本平台的相关活动，享受本平台提供的其他服务。
(三)	本平台合同文书范本下载中提供的范本为参考性文档，本平台不承诺或保证该等范本符合客户的实际需求，不承诺或保证该等范本在各方面、各领域、各条件下符合届时适用的各项法律法规、规范性文件或行业惯例，对于客户使用或修改该等范本的行为及后果，本平台不承担责任。
(四)	客户在本平台发布的需求信息应当基于真实的需要，不得发布恶意、虚假、无效的需求，不得存在扰乱本平台正常交易秩序的行为。基于维护交易秩序及交易安全的需要，本平台发现上述情形时可主动执行删除、屏蔽、撤销、关闭相关需求信息或交易订单等操作。
(五)	客户同意并确认，客户与服务方进行有偿在线交易前，须根据自身需求与服务方签订法律服务合同，并向本平台支付相应法律服务费，本平台按照平台结算规则与服务方进行结算。
(六)	本平台收费规则以平台公告展示内容为准。
(七)	对于通过本平台获取的服务信息，客户应避免通过任何方式将相关费用支付转移至本平台以外进行，否则对由此产生的风险或不利后果，客户将无法获得本平台的相关保障或救济。
(八)	客户有权在本平台提供的评价系统中对为其提供服务的服务方进行评价。客户的评价内容应当客观真实，不应包含任何污言秽语、色情低俗、广告信息及法律法规与本协议列明的其他禁止性信息；客户不应以不正当方式帮助他人提升信用或利用评价权利对他人实施威胁、敲诈勒索。若发生以上情形，本平台可按照相关规则对客户实施上述行为所产生的评价信息进行删除或屏蔽，并保留追究相关人员法律责任的权利。
(九)	客户在此承诺遵守本平台的一切协议或平台规范，包括但不限于本协议及各类争议规范或各类交易规范；若客户违反前述协议及各类争议规范或各类交易规范，乙方有权随时予以终止提供服务，终止方式包括但不限于：限制账户登录、权限、禁止使用账户等方式。
第六条	本平台向服务方提供的服务及使用规范
(一)	发布自身信息：服务方可以填写及完善账户信息，该等信息将发布及展示在服务方名片中；服务方的信息还将展示在“平台律师”板块。客户可通过搜索、筛选等方式，查阅及了解甲方的名片。
(二)	进行在线交易：服务方可以在本平台通过系统自动匹配、客户预约或主动接单的方式与客户达成交易，提供服务。
(三)	平台投稿及发布：服务方可以在本平台发布法律文书或其他宣传资料，从而使更多客户了解服务方的领域专长及执业经验。本平台对其发布内容的真实性、有效性、完整性不进行实质性审核，不承担相应后果。
(四)	服务方在此承诺遵守本平台的一切协议或平台规范，包括但不限于本协议及各类争议规范或各类交易规范；若服务方违反前述协议及各类争议规范或各类交易规范，本平台有权随时予以终止提供服务，终止方式包括但不限于：限制账户登录、权限、禁止使用账户等方式。
第七条	服务方的在线交易
(一)	服务方通过本平台的在线交易功能，可向客户提供：线上语音咨询、视频咨询、文书服务、事务办理等各类法律服务。
(二)	服务方进行在线交易时，均应遵守法律法规、监管部门政策、行业规则、行业惯例、执业规范、执业道德，符合社会公共利益及公共道德。如有违反导致任何法律后果的发生，服务方将以自己的名义独立承担所有相应的法律责任。
(三)	服务方和客户应当进行真实服务交易，不得进行以增加信用、销量等为目的的虚假交易。
(四)	服务方向客户提供服务应遵守本平台的交易流程、符合服务规范及客户保障的要求、遵守本平台各项交易规则，相关流程及规则。
(五)服务方明确了解并同意，服务方通过本平台的在线交易功能为客户提供服务过程中，服务方自身为服务的责任主体，本平台仅向服务方提供技术支持及平台服务，不就服务方提供的服务承担任何保证责任或连带责任。当发生服务争议时，服务方应积极与客户沟通协商，切实保障客户的合法权益。
第八条	风险提示
(一)	甲方在使用相关资料时应自行判断其正确、可靠、完整和及时性；甲方在使用相关交易信息及服务时，应自行判断其真实、合法和有效性；甲方须自行承担因使用前述资料信息服务而产生的风险及责任。服务方向客户提供的有偿服务受到双方之间协议条款（如涉及）的约束。
(二)	除与本平台另有约定外，本平台作为平台性网站或客户端，在客户与服务方进行的交易中，不构成居间、委托、代理、担保等法律关系，不对服务方向客户提供的服务承担保证或担保责任，不对客户在交易中发生的损失承担责任。
(三)	对于甲方使用本平台各项服务的行为，本平台没有主动审查的义务，但本平台有权依法通过合理方式对甲方行为进行监督。对于本平台知悉或合理怀疑甲方相关行为可能存在违法违规情形，可能侵害其他人员或本平台权益的，本平台有权发出询问、要求改正、向相关人员进行通知，或采取本平台认为必要的其他处理措施。
(四)	对由于信息网络设备维护、升级、连接故障，电脑、网络、通讯或其他系统的故障，计算机病毒或黑客攻击，以及地震，洪水，风暴，火灾，爆炸，战争，罢工，暴乱，政府行为，司法行政机关的命令等不可抗力或第三方原因造成的损害，本平台不承担责任。
第九条	平台注册及交易信息的拥有及保护
本平台客户或服务方一旦同意注册成为平台的会员，则完全同意且完全不可撤销授权同意下述事项：
(一)	对于客户在本平台提交的各类咨询问题或服务方回答的各类咨询问题，平台拥有所有权；
(二)	对于客户发布的各类订单信息或服务方接单或提供的各类服务信息和资料，平台亦拥有所有权；
(三)	对于上述信息，平台可以根据经营发展之需要予以保护或利用（但不透露或泄露任何客户的隐私信息）；
(四)	对于服务方在本平台上传的资质材料、法律文书、回答的各类问题、提供服务的全部内容等，本平台均有权予以采集，并根据本平台设定的相关规则对服务方予以排序并列入本平台排行榜。
(五)平台对于上述第一项的信息有权予以保护，任何人不得要求删除（司法机关要求或查看除外）；
(六)对于服务方注册后要求修改或删除信息的，应根据平台相应规则，由平台客服人员证实为本人信息后，予以修改或删除。
第十条	会员间的争议解决
(一)	在本平台交易过程中与其他会员发生争议的，争议各方均有权选择以下途径解决：1、与争议相对方自主协商；2、向有关行政部门或行业管理部门投诉；3、根据与争议相对方达成的仲裁协议（如有）提请仲裁机构仲裁；4、向人民法院提起诉讼；5、对于部分在线交易，会员可申请本平台介入争议并进行调处。
(二)	如争议任何一方申请本平台介入争议并进行调处，则表示争议各方均认可本平台的调处人员作为独立的第三方根据所了解到的争议事实并依据本平台规则所作出的判断及调处决定，并同意执行调处决定。甲方理解并同意，在争议调处中，调处方仅以普通人的认知对会员提供的信息及资料进行判断；除存在恶意外，本平台及调处人员对争议调处决定免责。
(三)	如甲方对本平台对争议调处所作决定不满意，甲方仍有权采取其他争议处理途径解决争议，但通过其他争议处理途径未取得终局决定前，甲方仍应先执行本平台调处决定。
第十一条	信息的保护及授权
(一)	本平台高度重视甲方个人信息的保护，在甲方使用本平台提供的服务时，甲方同意本平台按照隐私权政策收集、存储、使用、披露和保护甲方的信息。建议甲方完整地阅读隐私权政策，以帮助甲方更好地保护隐私权。
(二)	甲方声明并保证，对于在使用本平台服务过程中知悉的资料信息，应遵守相关知识产权的法律法规，不得侵犯本平台、乙方或第三方的知识产权。
(三)	甲方声明并保证，甲方对甲方所发布的信息拥有相应合法的权利，且不包含以下内容，否则，本平台可对甲方发布的信息依法或依本协议进行删除或屏蔽：
1.	违反国家法律法规禁止性规定的；
2.	政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
3.	欺诈、虚假、不准确或存在误导性的；
4.	侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；
5.	侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；
6.	存在可能破坏、篡改、删除、影响本平台任何系统正常运行或未经授权秘密获取本平台及其他会员的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；
7.	其他违背社会公共利益或公共道德或依据相关本平台规则的规定不适合在本平台发布的。
(四)	对于甲方提供及发布除个人信息外的文字、图片、视频、音频等信息，在版权保护期内甲方免费授予本平台、乙方及其关联公司使用权利及再授权给其他第三方使用的权利。甲方同意本平台、乙方及其关联公司存储、使用、复制、修订、编辑、发布、展示、翻译、分发甲方的非个人信息或制作其派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。
第十二条	平台订单服务完成的约定
会员就平台各类订单确认如下：
客户对律师或服务不满意的，首先由客户与律师进行沟通协商；双方协商不一致的，平台将依据《争议处理》规则进行调处；客户与律师在此确认同意并接受平台的调处结果，调处结果对双方均有约束力。
第十三条权利归属与隐私政策
除本平台自行开发的内容或产品外，其他信息均由甲方提供，该等信息的真实、准确、合法、有效由相对应的甲方承担责任。本平台展示的信息并不意味着本平台赞同其观点或证实其内容的真实与准确。任何单位或个人认为本平台内容涉嫌侵犯其合法权益的，应及时通过书面方式向本平台提出，并提交相关证明文件，包括但不限于身份证明、权利证明、侵权事实等。本平台在收到前述文件后，将对相关侵权内容依法及时予以处理。
（一）权利归属
1、除非本平台另有声明，本平台内的所有产品、技术、软件、程序、数据及其他信息（包括但不限于文字、图标、图片、照片、音频、视频、图表、色彩组合、版面设计等）的所有权利（包括但不限于版权、商标权、专利权、商业秘密等）均由本平台经营者或其关联公司所有。
2、未经本平台经营者或其关联公司书面许可，任何人不得以任何程序或设备监视、复制、传播、展示、镜像及其他方式使用本平台内的任何内容。
（二）隐私政策
本平台高度重视并保护所有使用本平台的人员之隐私权。为了提供更准确和个性化服务，本平台会按照本政策的规定使用甲方的个人信息，本平台将以高度勤勉、审慎义务对待该等信息。除本政策另有规定外，在未征得甲方事先许可的情况下，本平台不会将这些信息对外披露或向第三方提供。本平台将不时更新隐私权政策。本隐私权政策作为本平台注册协议的组成部分，您在同意注册协议时，即视为您已经同意本隐私政策的全部内容。
1、适用范围
（1）在您注册或登录本平台账户时，您提供的注册信息，包括但不限于姓名、身份证号、公司名称、统一社会信用代码、手机号、邮箱号、地址、注册时间、登录时间、预约详情、咨询详情、订单详情及您注册时上传的证件资料等数据；
（2）在您使用本平台服务或访问本平台时，您的浏览器和计算机上的信息，包括但不限于IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
（3）如您使用本平台移动客户端软件，或访问本平台移动网页时，与您位置及移动设备相关的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等；
（4）以下信息不适用本隐私权政策：您在使用本平台提供的搜索服务时输入的信息、您发布需求时选择的法律类别、服务方式、服务时限、选定律师的信息、评价信息等与交易相关的信息；违反法律法规或违反本平台规则的信息。
2、信息的使用和保护
（1）本平台仅在以下情况使用或披露您的信息：
a事先获得您的同意；
b只有披露该等信息，才能提供您所要求的产品或服务；
c根据法律相关规定或者行政、司法机构的要求向第三方或者行政、司法机构披露；
d为使本平台会员或其他方的人身财产权利免受重大损害；
e为维护本平台的交易秩序及合法权益；
f您违反了法律法规或本平台服务条款、规则、协议、政策等规定；
g其他依据法律法规或本平台服务政策认为适当的披露。
（2）本平台可能会与第三方合作向会员提供相关的服务，如该第三方同意承担与本平台同等的保护用户隐私的责任，则本平台有权将会员的相关信息等提供给该第三方。
（3）在不透露单个会员隐私资料的前提下，本平台有权对整个会员数据库进行分析并进行商业上的利用。
3、信息安全
在使用本平台服务时，您可能涉及要向交易对方或潜在的交易对方披露自己的相关信息。请您妥善保护自己的信息，仅在必要的情形下向他人提供。如您发现自己的信息泄露，尤其是您的账户及密码发生泄露，请您立即联络本平台，以便本平台采取相应措施。
第十四条	违约责任
(一)	本协议一方未履行本协议项下的任何一项条款均被视为违约。违约方应承担因自己的违约行为而给守约方造成的损失。
(二)	本平台可对甲方的违约行为采取以下处理方式：
1.	对有关信息或订单进行删除、屏蔽、撤销、关闭等；
2.	对有关行为进行限制，包括限制权限、中止向甲方提供部分或全部服务、查封账户、终止服务等；
3.	对甲方的违约行为或违法信息在本平台进行公示等。
(三)	如甲方的行为使乙方及其关联公司遭受损失的（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），甲方应当赔偿上述全部损失。
(四)	如甲方的行为使乙方及其关联公司受到第三人主张权利，则本平台、乙方及其关联公司有权在对第三人承担金钱给付义务后就全部损失向甲方追偿。
第十五条	协议的变更及终止
(一)	本平台可根据国家法律法规变化及维护交易秩序、本平台经营及发展等情况的需要，在不事先通知甲方的情况下，对本协议进行修改或补充，并及时发布于本平台。
(二)	甲方知悉并同意乙方可以随时根据国家相关法律、法规或规章或根据乙方经营发展的需要随时修改本平台的本协议或其他交易规则或平台规则或争议规则等，一旦平台将修改后的条款登载公示即生效，并替代原来的协议。甲方若继续使用本平台，即被视为对修改后的条款给予有效而不可撤销的同意。甲方在使用本平台时，应不定期查阅本协议，本平台不会就本协议条款的修改单独发送通知。
(三)	出现以下情况时，本平台有权终止本协议：
1.	甲方违反本协议约定，本平台依据违约条款终止本协议的；
2.	甲方盗用他人账户、发布违禁信息、骗取他人财物、售假、扰乱秩序、采取不正当手段谋利等行为，本平台依据平台规则对甲方的账户予以查封的；
3.	因甲方多次违反平台规则相关规定且情节严重，本平台依据平台规则对甲方的账户予以查封的；
4.	客户恶意对服务方投诉、或恶意使用本平台、或恶意中伤平台客服人员、或恶意向客服邮箱或客服管理平台发布不良信息、或不遵守平台协议或规范或规则的，平台有权予以终止提供服务，终止提供服务的方式包括但不限于：禁止登录、限制权限、查封账号等方式。
5.	服务方恶意投诉客户、或恶意使用本平台、或恶意中伤平台客服人员、或恶意向客服邮箱或客服管理平台发布不良信息、或不认真提供服务、或被客户投诉三次以上、或不遵守平台协议或规范或规则的，平台有权予以终止提供服务，终止提供服务的方式包括但不限于：禁止登录、限制权限、查封账号等方式。
6.	其它应当终止服务的情况。
(四)	本协议终止后，除法律有明确规定外，本平台无义务向甲方或第三方披露账户中的任何信息。
(五)	本协议终止后，对于甲方过往的违约行为，本平台仍可依据本协议向甲方追究责任。
(六)	本协议终止后，对于甲方终止前发生的交易订单，如交易对方要求继续履行的，甲方应当继续履行交易订单的约定，并承担因此发生的损失或增加的费用。
第十六条	其他
(一)	本协议采取网上确认的形式进行签署，自甲方同意之日起生效。
(二)	本协议的成立、效力、解释、履行、签署、修订和终止以及争议的解决均应适用中华人民共和国大陆法律。
(三)	甲方与乙方任何争议，包括服务方或客户与本平台、本平台经营者及其关联公司之间发生的任何争议，各方一致同意均提请长沙仲裁委员会按照其仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。
(四)	甲方同意本平台通过以下任何方式向甲方送达各类通知或文件，包括但不限于：网页公告、系统通知、客户端推送消息、向甲方预留的联系方式发送电子邮件、短信、信函等。
(五)	本平台的其他规则或规范内容或平台描述或平台表述如果与本协议相冲突，以本协议为准。
(六)	如果本协议的任何条款被视为不合法、无效或无法强制执行的，其不应影响本协议任何其他条款的有效性或可执行性。''';
